Catalogs/НастройкиПечатиЧеков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>НастройкиПечатиЧеков</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПравилоПечатиЧековЕНВД</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПравилаПечатиЧековЕНВД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеОтбор</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяСистемаНалогообложения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СистемыНалогообложения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьУчетПоЕНВД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДСДляОсновнойСистемыНалогообложения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазваниеДляВзносаВыдачиДенежныхСредств</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособФормированияТелефонаКлиента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыФормированияТелефонногоКода</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступныАвансовыеПлатежи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступныКредитныеПлатежи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравилоПечатиКодаНМУ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПравилаПечатиКодаУслугиВЧеке</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьУчетПоПатенту</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеОтборПатент</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособФискализацииМатериалов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособФискализацииРасходныхМатериалов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатураФискализацииМатериалов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/СистемыНалогообложения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СистемыНалогообложения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Общая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УпрощеннаяДоход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УпрощеннаяДоходМинусРасход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕдиныйНалогНаВмененныйДоход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕдиныйСельскохозяйственныйНалог</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПатентнаяСистемаНалогообложения</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтавкиНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НДС18</Name>
					<Comment>Ставка НДС 18%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС18_118</Name>
					<Comment>Расчетная ставка НДС 18/118</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10</Name>
					<Comment>Ставка НДС 10%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10_110</Name>
					<Comment>Расчетная ставка НДС 10/110</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС0</Name>
					<Comment>Ставка НДС 0%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20</Name>
					<Comment>Ставка НДС 20%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20_120</Name>
					<Comment>Расчетная ставка НДС 20/120</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС5</Name>
					<Comment>Ставка НДС 5%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС5_105</Name>
					<Comment>Расчетная ставка НДС 5/105</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС7</Name>
					<Comment>Ставка НДС 7%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС7_107</Name>
					<Comment>Расчетная ставка НДС 7/107</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС12</Name>
					<Comment>Ставка НДС 12%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС16</Name>
					<Comment>Ставка НДС 16%</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/НастройкиПечатиЧеков/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Макет отбора для редактирования в форме.
//
// Возвращаемое значение:
//  СхемаКомпоновкиДанных.
//
Функция ПолучитьМакетПолейШаблона() Экспорт
	Возврат ПолучитьМакет("ПоляШаблона");
КонецФункции

// Макет отбора для применения при печати чеков.
//
// Возвращаемое значение:
//  СхемаКомпоновкиДанных.
//
Функция ПолучитьМакетВыполненияОтбора() Экспорт
	Возврат ПолучитьМакет("МакетВыполненияОтбора");
КонецФункции

Функция СтавкаНДСПоНастройкеПечатиЧеков(НастройкаПечатиЧеков, Организация, Дата = Неопределено) Экспорт
	
	ДатаНДС = ?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДатаСеанса());

	СНО = НастройкаПечатиЧеков.ОсновнаяСистемаНалогообложения;
	ОсновныеСтавкиНСД = УчетНДСВызовСервера.ОсновныеСтавкиНДСпоСНО();
	пчСНО = Перечисления.СистемыНалогообложения;
	
	// Ставка по умолчанию
	СтавкаНДС = ОсновныеСтавкиНСД.Получить(СНО);
	Если СтавкаНДС = Неопределено Тогда
		СтавкаНДС = Перечисления.СтавкиНДС.НДС20;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Организация)
		И (	СНО = Перечисления.СистемыНалогообложения.УпрощеннаяДоход Или
			СНО = Перечисления.СистемыНалогообложения.УпрощеннаяДоходМинусРасход)
	Тогда
		СтавкаНДС = УчетНДСВызовСервера.ПолучитьСтавкуНДСДляУСН(Организация, ДатаНДС);
	КонецЕсли;	
	
	Возврат СтавкаНДС;
	
КонецФункции

#КонецОбласти
